tutorials/fluidSolidInteraction/beamInCrossFlow/overset/elasticBeam/constant/motionSubset/oversetMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      oversetMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolation
{
    interpolationSchemes (inverseDistance);
    default inverseDistance;

  
    // interpolationSchemes ( injection );
    // default injection;
}

holePatches  ();

regions
(
);


// ************************************************************************* //
